export enum CategoryGroupCode {
  /**
   * 대형마트
   * @example 이마트, 홈플러스, 롯데마트, 하나로마트
   */
  MT1 = 'MT1',

  /**
   * 편의점
   * @example CU, GS25, 7-11
   */
  CS2 = 'CS2',

  /**
   * 어린이집, 유치원
   */
  PS3 = 'PS3',

  /**
   * 학교
   * @example 초등학교, 중학교, 고등학교
   */
  SC4 = 'SC4',

  /**
   * 학원
   * @example 학원, 교육원
   */
  AC5 = 'AC5',

  /**
   * 주차장
   */
  PK6 = 'PK6',

  /**
   * 주유소, 충전소
   */
  OL7 = 'OL7',

  /**
   * 지하철역
   */
  SW8 = 'SW8',

  /**
   * 은행
   * @example 은행, 농협, 신협
   */
  BK9 = 'BK9',

  /**
   * 문화시설
   * @example 영화관, 공연장, 박물관, 미술관
   */
  CT1 = 'CT1',

  /**
   * 중개업소
   */
  AG2 = 'AG2',

  /**
   * 공공기관
   * @example 공공기관, 공기업
   */
  PO3 = 'PO3',

  /**
   * 관광명소
   */
  AT4 = 'AT4',

  /**
   * 숙박
   * @example 호텔, 모텔, 펜션
   */
  AD5 = 'AD5',

  /**
   * 음식점
   */
  FD6 = 'FD6',

  /**
   * 카페
   */
  CE7 = 'CE7',

  /**
   * 병원
   * @example 병원, 의원
   */
  HP8 = 'HP8',

  /**
   * 약국
   */
  PM9 = 'PM9'
}
